"""Module utilities for city levels."""


Megacity_list = ['上海市', '北京市', '深圳市', '重庆市', '广州市', '成都市', '天津市']
Supercity_list = ['武汉市', '东莞市', '西安市', '杭州市', '佛山市', '南京市', '沈阳市', '青岛市', '济南市', '长沙市', '哈尔滨市',
                  '郑州市', '昆明市', '大连市']
Type_I_Large_Cities_list = [
    '南宁市', '石家庄市', '厦门市', '太原市', '苏州市', '贵阳市', '合肥市',
    '乌鲁木齐市', '宁波市', '无锡市', '福州市', '长春市', '南昌市', '常州市'
]
Type_II_Large_Cities_list = [
    '兰州市', '中山市', '惠州市', '汕头市', '临沂市', '淄博市', '温州市', '呼和浩特市', '绍兴市',
    '唐山市', '海口市', '柳州市', '徐州市', '烟台市', '洛阳市', '邯郸市', '珠海市', '包头市',
    '保定市', '潍坊市', '大同市', '江门市', '赣州市', '西宁市', '南通市', '银川市', '扬州市',
    '遵义市', '襄阳市', '鞍山市', '昆山市', '莆田市', '绵阳市', '盐城市', '泉州市', '咸阳市',
    '台州市', '芜湖市', '株洲市', '淮安市', '济宁市', '吉林市', '大庆市', '桂林市', '秦皇岛市',
    '湛江市', '宜昌市', '齐齐哈尔市', '抚顺市', '上饶市', '南充市', '义乌市', '邢台市', '泰安市',
    '开封市', '张家口市', '新乡市', '聊城市', '淮南市', '十堰市', '宜宾市', '枣庄市', '岳阳市',
    '慈溪市', '衡阳市', '长治市', '连云港市', '赤峰市', '晋江市', '泸州市'
]
Medium_sized_cites_list = [
    '安阳市', '平顶山市', '嘉兴市', '瑞安市', '泰州市', '曲靖市', '达州市', '营口市', '揭阳市',
    '盘锦市', '潮州市', '东营市', '茂名市', '常德市', '九江市', '清远市', '信阳市', '乐清市',
    '马鞍山市', '阜阳市', '日照市', '宝鸡市', '南阳市', '衡水市', '肇庆市', '江阴市', '常熟市',
    '宿迁市', '榆林市', '荆州市', '许昌市', '六安市', '菏泽市', '淮北市', '沧州市', '金华市',
    '镇江市', '晋中市', '抚州市', '焦作市', '郴州市', '余姚市', '自贡市', '本溪市', '漳州市',
    '商丘市', '周口市', '遂宁市', '湖州市', '阳江市', '滨州市', '辽阳市', '韶关市', '龙岩市',
    '牡丹江市', '玉林市', '湘潭市', '滕州市', '贵港市', '六盘水市', '乐山市', '孝感市',
    '三亚市', '阜新市', '蚌埠市', '丹东市', '新余市', '宜春市', '眉山市', '佳木斯市', '黄石市',
    '攀枝花市', '鄂尔多斯市', '威海市', '临汾市', '德阳市', '廊坊市', '漯河市', '德州市', '梅州市',
    '天水市', '运城市', '温岭市', '安庆市', '葫芦岛市', '濮阳市', '北海市', '宿州市', '亳州市',
    '邵阳市', '河源市', '三河市', '伊宁市', '鸡西市', '萍乡市', '梧州市', '延吉市', '毕节市',
    '晋城市', '邳州市', '宜兴市', '舟山市', '诸暨市', '怀化市', '荆门市',
    '朝阳市', '永州市', '诸城市', '兴义市', '铜陵市', '简阳市', '内江市', '胶州市', '拉萨市',
    '永康市', '西昌市', '娄底市', '景德镇市', '承德市', '安顺市', '桐乡市', '衢州市', '汉中市',
    '大理市', '鹤壁市', '钦州市', '乌海市', '玉溪市', '益阳市', '阳泉市', '寿光市', '张家港市',
    '永城市', '鹤岗市'
]

